//Калкулатор депозити

//Напишете програма, която изчислява каква сума ще получите в края на депозитния период при определен лихвен процент. Използвайте следната формула: 
//сума = депозирана сума + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)

//Вход

//От конзолата се четат 3 реда:
//⦁	Депозирана сума – реално число в интервала [100.00 … 10000.00]
//⦁	Срок на депозита (в месеци) – цяло число в интервала [1…12]
//⦁	Годишен лихвен процент – реално число в интервала [0.00 …100.00]

//Изход

//Да се отпечата на конзолата сумата в края на срока.




using System;
internal class Program
{
    static void Main()
    {
        decimal deposit = decimal.Parse(Console.ReadLine());
        int deadline = int.Parse(Console.ReadLine());
        decimal interest = decimal.Parse(Console.ReadLine()) * 0.01m;   
        decimal sum = deposit + deadline * ((deposit * interest) / 12);
        Console.WriteLine(sum); 
    }
}


